MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX470F512L.PIC
      <edc:AdjustPoint edc:_addr="0x1F80FA98" edc:offset="56"/>
      <edc:SFRDef edc:_addr="0x1F80FAD0" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01618_RPINRx.Module" edc:_refcount="29" edc:access="----------------------------nnnn" edc:cname="REFCLKIR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="REFCLKIR" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="REFCLKIR" edc:desc="" edc:mask="0xf" edc:name="REFCLKIR" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F80FAD4" edc:offset="100"/>
      <edc:SFRDef edc:_addr="0x1F80FB38" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01618_RPORx.Module" edc:_refcount="1" edc:access="----------------------------nnnn" edc:cname="RPA14R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPA14R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPA14R" edc:desc="" edc:mask="0xf" edc:name="RPA14R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FB3C" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01618_RPORx.Module" edc:_refcount="2" edc:access="----------------------------nnnn" edc:cname="RPA15R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPA15R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPA15R" edc:desc="" edc:mask="0xf" edc:name="RPA15R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FB40" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01618_RPORx.Module" edc:_refcount="3" edc:access="----------------------------nnnn" edc:cname="RPB0R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPB0R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPB0R" edc:desc="" edc:mask="0xf" edc:name="RPB0R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FB44" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01618_RPORx.Module" edc:_refcount="4" edc:access="----------------------------nnnn" edc:cname="RPB1R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPB1R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPB1R" edc:desc="" edc:mask="0xf" edc:name="RPB1R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FB48" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01618_RPORx.Module" edc:_refcount="5" edc:access="----------------------------nnnn" edc:cname="RPB2R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPB2R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPB2R" edc:desc="" edc:mask="0xf" edc:name="RPB2R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FB4C" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01618_RPORx.Module" edc:_refcount="6" edc:access="----------------------------nnnn" edc:cname="RPB3R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPB3R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPB3R" edc:desc="" edc:mask="0xf" edc:name="RPB3R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F80FB50" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F80FB54" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01618_RPORx.Module" edc:_refcount="7" edc:access="----------------------------nnnn" edc:cname="RPB5R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPB5R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPB5R" edc:desc="" edc:mask="0xf" edc:name="RPB5R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FB58" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01618_RPORx.Module" edc:_refcount="8" edc:access="----------------------------nnnn" edc:cname="RPB6R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPB6R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPB6R" edc:desc="" edc:mask="0xf" edc:name="RPB6R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
