MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX470F512L.PIC
      <edc:SFRDef edc:_addr="0x1F80FB5C" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01618_RPORx.Module" edc:_refcount="9" edc:access="----------------------------nnnn" edc:cname="RPB7R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPB7R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPB7R" edc:desc="" edc:mask="0xf" edc:name="RPB7R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FB60" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01618_RPORx.Module" edc:_refcount="10" edc:access="----------------------------nnnn" edc:cname="RPB8R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPB8R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPB8R" edc:desc="" edc:mask="0xf" edc:name="RPB8R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FB64" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01618_RPORx.Module" edc:_refcount="11" edc:access="----------------------------nnnn" edc:cname="RPB9R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPB9R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPB9R" edc:desc="" edc:mask="0xf" edc:name="RPB9R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FB68" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01618_RPORx.Module" edc:_refcount="12" edc:access="----------------------------nnnn" edc:cname="RPB10R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPB10R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPB10R" edc:desc="" edc:mask="0xf" edc:name="RPB10R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F80FB6C" edc:offset="12"/>
      <edc:SFRDef edc:_addr="0x1F80FB78" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01618_RPORx.Module" edc:_refcount="13" edc:access="----------------------------nnnn" edc:cname="RPB14R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPB14R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPB14R" edc:desc="" edc:mask="0xf" edc:name="RPB14R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FB7C" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01618_RPORx.Module" edc:_refcount="14" edc:access="----------------------------nnnn" edc:cname="RPB15R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPB15R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPB15R" edc:desc="" edc:mask="0xf" edc:name="RPB15R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F80FB80" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F80FB84" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01618_RPORx.Module" edc:_refcount="15" edc:access="----------------------------nnnn" edc:cname="RPC1R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPC1R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC1R" edc:desc="" edc:mask="0xf" edc:name="RPC1R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FB88" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01618_RPORx.Module" edc:_refcount="16" edc:access="----------------------------nnnn" edc:cname="RPC2R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPC2R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC2R" edc:desc="" edc:mask="0xf" edc:name="RPC2R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FB8C" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01618_RPORx.Module" edc:_refcount="17" edc:access="----------------------------nnnn" edc:cname="RPC3R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPC3R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC3R" edc:desc="" edc:mask="0xf" edc:name="RPC3R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FB90" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01618_RPORx.Module" edc:_refcount="18" edc:access="----------------------------nnnn" edc:cname="RPC4R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPC4R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC4R" edc:desc="" edc:mask="0xf" edc:name="RPC4R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
